using System.ComponentModel.Design;

namespace ConsoleApp10
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Enter the number beetwin 50-70");
            int number = Convert.ToInt32(Console.ReadLine());
            //int result;

            for (int i = 50; i <= 70; i++)
            {
                while (number != 1)

                {
                    if (i % 2 == 0)
                    {
                        number = number / 2;
                        Console.WriteLine(number);
                     
                    }


                    else if (i % 2 == 1)
                    {
                        number = ((number * 3) + 1) / 2;
                        //i = number;
                        Console.WriteLine(number);
                    }
                    else
                    {
                        Console.WriteLine(1);
                    }
                    
                    //վերցնում ենք թիվ 50-70 թվերի միջև ընկած, ենթադրենք վերցրել ենք 4 նշանակում է որ զույգ է , ստուգում ենք զույգությունը, ու տպում , ենթադրենք 4 2 1 
                    //եթե կենտ է կատարում ենք հետևյալը՝ թիվը բազմապատկում ենք 3-ով հետո + 1 , ստացվածը բաժանում 2-ի, երբ նոր թիվ ենք ստանում նորից նույն գործողությունները կրկնում ենք , այնքան որ ստացվի ամեբավերջում 1-եր, մեր  պարագայում պետք է ստանանք 20 հատ 1։
                    //    Աըսինքն սրանից կարող ենք եզրակացնել որ գործ ունենք ցիկլի հետ որը ներառում է նշված միջակայքը ու արդեն ցիկլի մեջ դնում ենք պայմաններ և եթե մեր դրած պայմանին բավարարում է ապա տպում ենք առաջի դեպքում նոր թիվը որը ստացել ենք 2-ի բաժանելիս , 2-րդ պայմանի դեպքում գործողության արդյունքում ստացված թիվը,հետո այդ թվի հետ ենք կատարում ((x*3+1)/2), և սա այնքան ենք շարունակում մինչև որ կստատանք 1-եր։
                }

            }
        }
    }
}